{
  "backend/main.mo": "Main backend actor implementing photo CRUD operations (add, delete, get, getAll) with authentication checks that reject anonymous callers, using Map storage and blob-storage mixin.",
  "feature_evidence.json": "Feature evidence report documenting two authentication requirements (upload and delete) for MediaGallery component with high confidence and test IDs REQ-30 and REQ-31.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 19 frontend files including components, hooks, pages, and configuration files for a portfolio application with photo gallery functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for backgrounds, foregrounds, borders, and component states.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'Meghana Jha Portfolio', and script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component wrapping the Home page with ThemeProvider, InternetIdentityProvider, QueryClientProvider, and Toaster for notifications.",
  "frontend/src/components/Contact.tsx": "Contact card component displaying phone number (+91 7879010587) and email (meghana250306@gmail.com) with icons and clickable links.",
  "frontend/src/components/Education.tsx": "Education timeline displaying three academic entries (BSc at BCAS, Class XII, Class X) with grades, dates, and special highlighting for Class X top 1.5% achievement.",
  "frontend/src/components/HackathonConcept.tsx": "Detailed showcase of TrackEd, the EduThon 2025 winning project, including problem statement, solution overview, six key features, and expected impact sections.",
  "frontend/src/components/Hobbies.tsx": "Hobbies card displaying six interests (Article Writing, Journal Writing, Novel reading, Poetry, Chess, Painting) in a two-column grid with icons.",
  "frontend/src/components/Languages.tsx": "Languages proficiency card showing English (95% Fluent), Hindi (100% Native), and Sanskrit (70% Learned) with progress bars.",
  "frontend/src/components/Layout.tsx": "Main layout component providing sticky header with navigation links, contact icons (email/phone), main content area, and footer with copyright and caffeine.ai attribution.",
  "frontend/src/components/MediaGallery.tsx": "Photo gallery component with Internet Identity authentication, supporting photo upload with progress tracking, deletion with confirmation dialog, and grid display of all photos with lightbox view.",
  "frontend/src/components/Profile.tsx": "Profile section displaying a brief bio for a Biomedical Science student seeking clinical laboratory experience and professional growth opportunities.",
  "frontend/src/components/ProjectsInternships.tsx": "Displays projects, internships, and achievements (including EduThon 2025 winner, hospital internship, publications) along with a list of academic activities and skills demonstrations.",
  "frontend/src/components/References.tsx": "Card component listing three academic references from BCAS professors with their names, titles, and email contact information.",
  "frontend/src/components/Skills.tsx": "Skills section displaying a collection of technical and soft skills (Excel, lab techniques, research, collaboration, etc.) as interactive badges in a centered grid layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useDeletePhoto.ts": "React Query mutation hook for deleting photos via the backend actor, automatically invalidating the photos query cache on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity state, and login status tracking with configurable options.",
  "frontend/src/hooks/useMediaUpload.ts": "Hook providing photo upload functionality with progress tracking, converting files to ExternalBlob format, calling backend actor to store photos, and invalidating cache on success.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching individual photos, all photos, and invalidating photo queries using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a sophisticated earth-tone color scheme with teal accents for both light and dark modes, plus base styling for smooth scrolling and typography.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Home.tsx": "Main homepage component with hero section featuring profile photo and multiple content sections (Profile, Education, Projects, Skills, Contact, etc.) organized in a single-page layout.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom fonts (Inter, Merriweather, JetBrains Mono), OKLCH color system, container settings, shadows, and animation keyframes for accordions.",
  "project_state.json": "Project metadata describing a portfolio website for Meghana Jha with known issues around photo display and authentication, listing existing features for profile sections, education, projects, skills, and media gallery."
}