{
  "backend/main.mo": "Main Motoko actor that includes blob storage mixin and provides CRUD operations for storing and retrieving photo and certificate data with external blob references.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (hero section, profile, contact, education, projects, skills, gallery, hobbies, languages, references) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing component purposes, from main App setup through individual portfolio sections and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for consistent design system.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Meghana Jha Portfolio', and root div mounting the React application.",
  "frontend/src/App.tsx": "Root React component wrapping the application with ThemeProvider, QueryClientProvider, and Toaster, rendering the Home page.",
  "frontend/src/components/Contact.tsx": "Contact card component displaying phone number and email with clickable links and Mail/Phone icons in a styled card layout.",
  "frontend/src/components/Education.tsx": "Education timeline displaying three academic entries (BCAS, KV Class XII, KV Class X) with grades, dates, and special award highlighting for top 1.5% achievement.",
  "frontend/src/components/Hobbies.tsx": "Hobbies card displaying six interests (Article Writing, Journal Writing, Novel reading, Poetry, Chess, Painting) in a two-column grid with icons.",
  "frontend/src/components/Languages.tsx": "Languages proficiency card showing English, Hindi, and Sanskrit with progress bars indicating fluency levels (95%, 100%, 70%).",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing sticky header with navigation links and contact icons, plus footer with copyright and caffeine.ai attribution.",
  "frontend/src/components/MediaGallery.tsx": "React component that displays a tabbed gallery for photos and certificates with upload functionality, progress tracking, and modal dialogs for viewing media. Uses custom hooks for media upload and displays items in a grid layout.",
  "frontend/src/components/Profile.tsx": "Simple profile component that displays a centered card with a brief bio statement about a Biomedical Science student seeking clinical laboratory experience.",
  "frontend/src/components/ProjectsInternships.tsx": "Displays a grid of project/internship cards (including EduThon winner, hospital intern, student activities, and published articles) plus a list of academic activities and achievements.",
  "frontend/src/components/References.tsx": "Card component listing three academic references with names, titles, and clickable email addresses for professors at BCAS.",
  "frontend/src/components/Skills.tsx": "Displays a centered collection of skill badges including technical, laboratory, and soft skills in a flex-wrapped layout.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the ICP backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useMediaUpload.ts": "Custom hook that handles photo and certificate uploads to the ICP backend using ExternalBlob, tracks upload progress, and manages local state for displaying uploaded media.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks (useGetPhoto and useGetCertificate) for fetching individual photo and certificate data from the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a sophisticated earth-tone color scheme with teal accents for light and dark modes, including primary, secondary, accent, and chart colors optimized for an academic/scientific aesthetic.",
  "frontend/src/main.tsx": "React application entry point that sets up the root render with QueryClient for data fetching and InternetIdentityProvider for authentication, wrapping the main App component.",
  "frontend/src/pages/Home.tsx": "Main homepage component that renders a hero section with profile photo and call-to-action buttons, followed by organized sections for Profile, Education, Projects, Skills, MediaGallery, Hobbies, Languages, References, and Contact information.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom fonts (Inter, Merriweather, JetBrains Mono), OKLCH color system mapping to CSS variables, custom border radius, shadows, and accordion animations, plus typography and container-queries plugins.",
  "project_state.json": "Project metadata defining a personal portfolio website for Meghana Jha (BSc Biomedical Science student), documenting architectural structure with multiple sections, image requirements for profile photo and certificate backgrounds, and tracking 10 implemented features covering homepage, profile, contact, education, projects, skills, hobbies, languages, references, and media gallery sections."
}