{
  "backend/main.mo": "Main actor defining PhotoData and CertificateData types with storage maps, providing public functions to add/get/list photos and certificates using blob storage mixin.",
  "feature_evidence.json": "Feature evidence report documenting two debugging/fix tasks for MediaGallery certificate rendering issues, both targeting the same component file with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, pages, and configuration files with detailed descriptions of their functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for consistent design system.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the application with ThemeProvider, QueryClientProvider, and Toaster for global state and UI management.",
  "frontend/src/components/Contact.tsx": "Contact card component displaying phone number and email with icons and clickable links in a styled card layout.",
  "frontend/src/components/Education.tsx": "Education timeline component rendering three academic entries with grades, dates, and special highlighting for Class X achievement award.",
  "frontend/src/components/HackathonConcept.tsx": "Hackathon concept showcase displaying the TrackEd project with problem statement, solution overview, feature grid, and EduThon 2025 winner badge.",
  "frontend/src/components/Hobbies.tsx": "Hobbies card displaying six personal interests with corresponding icons in a two-column grid layout with hover effects.",
  "frontend/src/components/Languages.tsx": "Languages proficiency card showing three languages with progress bars and proficiency level labels (Fluent, Native, Learned).",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, social/contact links, and footer with caffeine.ai attribution. Provides consistent page structure with header, main content area, and footer.",
  "frontend/src/components/MediaGallery.tsx": "Gallery component with tabs for photos and certificates, featuring file upload with progress tracking, image/document preview dialogs, and integration with backend queries. Handles media upload via custom hooks with validation and progress callbacks.",
  "frontend/src/components/Profile.tsx": "Simple profile section displaying a centered card with a professional bio for a Biomedical Science student seeking clinical laboratory experience.",
  "frontend/src/components/ProjectsInternships.tsx": "Displays projects, internships, and achievements in a grid layout with highlighted items (EduThon winner, hospital internship, publications). Includes a separate section listing academic activities and achievements.",
  "frontend/src/components/References.tsx": "Card component displaying three academic references with names, titles, and clickable email addresses for professors at BCAS.",
  "frontend/src/components/Skills.tsx": "Skills section displaying a collection of technical and soft skills as interactive badges in a centered, wrapped layout within a card component.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login/logout functions and status tracking (initializing, idle, logging-in, success, error).",
  "frontend/src/hooks/useMediaUpload.ts": "Custom React hook providing photo and certificate upload functionality using ExternalBlob for file handling, with progress tracking, toast notifications, and automatic cache invalidation after successful uploads.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching individual and all photos/certificates from the backend actor, plus a hook for invalidating media queries to trigger refetches.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a sophisticated earth-tone color palette with teal accents for light and dark modes, using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/Home.tsx": "Main homepage component rendering a hero section with profile photo and multiple content sections including Profile, Education, Projects, Skills, Contact, and MediaGallery in a structured layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color system, container settings, shadows, and animations for accordion components.",
  "project_state.json": "Project metadata tracking the portfolio website's features, architecture, and known issues—specifically that photos and certificates upload successfully but don't display on the frontend."
}