{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix certificate display in MediaGallery",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Debug the MediaGallery component's certificate tab to identify why certificates are not rendering despite photos working correctly",
      "acceptanceCriteria": [
        "Console logging shows certificate data being fetched from backend",
        "Certificate blob URLs are successfully generated",
        "Root cause of certificate display issue is identified"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MediaGallery.tsx",
          "operation": "modify",
          "description": "Add console logging to the certificate rendering logic to track data flow from the useCertificates hook through the grid rendering. Log the raw certificate data, the generated blob URLs using getDirectURL(), and any rendering conditions that might prevent display. Compare the certificate rendering path with the working photo rendering path to identify discrepancies."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Verify that the useCertificates and useCertificate hooks properly handle the blob data format and convert it to displayable URLs using the same pattern that works for photos",
      "acceptanceCriteria": [
        "useCertificates hook returns valid blob URLs for all certificates",
        "useCertificate hook returns valid blob URL for individual certificate",
        "Blob URL generation follows the same working pattern as photo hooks"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useCertificates and useCertificate hooks to ensure they handle ExternalBlob data correctly. Verify that the hooks call getDirectURL() on the certificate file field (matching how photo hooks use getDirectURL() on the image field). Add null checks and error handling to match the working photo hook patterns. Ensure the query keys and data transformation logic align with the backend interface where CertificateData.file is an ExternalBlob."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Fix the MediaGallery component to properly render the certificates tab with uploaded certificates displaying in the gallery grid",
      "acceptanceCriteria": [
        "Certificates tab shows uploaded certificate images in a grid",
        "Each certificate card displays the image with title and upload date",
        "Clicking a certificate opens it in the modal viewer",
        "Upload new certificate button works correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MediaGallery.tsx",
          "operation": "modify",
          "description": "Fix the certificates tab rendering to display certificate data correctly. Ensure the certificate grid maps over the data returned from useCertificates, renders each certificate card with the image using cert.file.getDirectURL(), displays the title and relevant metadata, and wires up the modal dialog for viewing individual certificates. Verify the upload button triggers the certificate upload flow from useMediaUpload. Maintain the same visual treatment and grid layout as the working photos tab."
        }
      ]
    }
  ]
}